{
    "jobs": [
        {
            "name": "KnightHacks",
            "title": "Hackathon Organizer",
            "rarity": "Legendary",
            "description": "KnightHacks is a UCF RSO for software development, which hosts a yearly hackathon, also named KnightHacks. Consistently, our hackathons have pulled 700+ people, and reach almost 100 projects submitted. From my experience volunteering and participating in various hackathons, I was brought onto the team to organize KnightHacks VIII, which will be held in October of 2025.",
            "time": "7/25 - Present",
            "links": [
                "https://club.knighthacks.org/"
            ],
            "location": "Orlando, FL",
            "logo": "knighthacks.jpg",
            "bullets": [
                "Working with our directing team to utilize over $60,000 worth of event funding.",
                "Constructing an environment that provides hundreds of student hackers deadline-limited programming experience.",
                "Assisting in logistics for a target of 1000+ people attending the event.",
                "Planning engaging events to combat development burnout and make KnightHacks truly memorable."
            ],
            "skills": [
                "Leadership", "Fundraising", "Event Planning", "Logistics", "Teamwork", "Budgeting"
            ]
        },
        {
            "name": "DenTraceX",
            "title": "Lead Developer, VP",
            "rarity": "Rare",
            "description": "DenTraceX is a Florida non-profit organization dedicated to collecting dental records of missing persons, in order to cross-reference them with unidentified remains. My main role as Lead Developer is the implementation of the entire organization's tech stack, such as our database, security, and client-facing webpages. While we are not active yet, we are targeting a launch by September 2025.",
            "time": "5/25 - Present",
            "links": [
                "https://www.instagram.com/dentracex/"
            ],
            "location": "Orlando, FL",
            "logo": "dentracex.jpg",
            "bullets": [
                "Assist in the incorporation and management of a non-profit organization focused on a public good.",
                "Authoring a secure database from the ground up to make submitting and accessing data for medical examiners as accessible as possible.",
                "Working with a team of diverse disciplines to process and handle sensitive medical information, such as outreach and design."
            ],
            "skills": [
                "Project Management", "Teamwork", "Corporation Development", "Web Development", "Server Management"
            ]
        },
        {
            "name": "Publix Super Markets",
            "title": "Cashier",
            "rarity": "Uncommon",
            "description": "Working as a Cashier, I interact with hundreds of customers a day, making sure that their needs are met and that they are truly happy to shop at Publix. As my first job, it's where I built much of my soft skills and self-accountability.",
            "time": "2/23 - Present",
            "links": [
                "https://corporate.publix.com/"
            ],
            "location": "Orlando, FL",
            "logo": "Publix_Retail_Logo.png",
            "bullets": [
                "Processing customer transactions efficiently while providing great service.",
                "Able to adapt easily to changes in working condition/customer inflow.",
                "Working as a team to ensure the completion of all daily tasks while keeping store operations running smoothly."
            ],
            "skills": [
                "Customer Service", "Conflict Resolution", "Adaptability", "Teamwork"
            ]
        }
    ]
}